var major_array=[];
var sub_array=[];
major_array[0]='人文社科';
sub_array[0]=new Array('犯罪学',
						'经济学',
						'英语',
						'历史',
						'政治学',
						'心理学',
						'社会学',
						'哲学',
						'考古学');

major_array[1]='自然科学';
sub_array[1]=new Array('生物学',
						'化学',
						'计算机',
						'地球科学',
						'数学',
						'物理学',
						'统计学');

major_array[2]='商科';
sub_array[2]=new Array('会计',
						'金融',
						'信息系统',
						'管理学',
						'市场营销',
						'人力资源管理',
						'生产管理',
						'物流供应链管理',
						'工商管理硕士',
						'国际贸易',
						'高层工商管理硕士',
						'酒店管理',
						'体育管理');

major_array[3]='医学';
sub_array[3]=new Array('性学',
						'毒品酒精滥用',
						'家庭医学',
						'老人病学',
						'内科医学',
						'小儿科',
						'农村医学',
						'妇科',
						'基础护理');

major_array[4]='法律';
sub_array[4]=new Array('实务训练',
						'争端解决',
						'环境法',
						'卫生保健法',
						'知识产权法',
						'国际法',
						'法律写作',
						'税法',
						'辩护',
						'LLM');

major_array[5]='教育学';
sub_array[5]=new Array('课程与教学',
						'教育管理学',
						'教育政策',
						'教育心理',
						'幼教',
						'高等教育管理',
						'中学教育',
						'特殊教育',
						'教育咨询与服务',
						'职业技术教育',
						'TESOL');

major_array[6]='工程';
sub_array[6]=new Array('工程',
						'航空航天工程',
						'生物/农业工程',
						'生物医药/生物工程',
						'化学工程',
						'土木工程',
						'计算机工程',
						'电子/通讯工程',
						'环境卫生工程',
						'工业/制造工程',
						'材料工程',
						'机械工程',
						'核工程');

major_array[7]='健康';
sub_array[7]=new Array('听力学',
						'临床心理学',
						'卫生保健管理',
						'护理学',
						'麻醉',
						'产科',
						'职业治疗',
						'药学',
						'物理治疗法',
						'医师助理',
						'公共卫生',
						'康复咨询',
						'社会工作',
						'语言病理学',
						'兽医学');

major_array[8]='公共事务';
sub_array[8]=new Array('城市管理与政策',
						'环境政策与管理',
						'健康政策与管理',
						'信息技术管理',
						'非盈利管理',
						'财政与预算',
						'公共行政管理',
						'公共政策分析',
						'社会政策');

major_array[9]='艺术';
sub_array[9]=new Array('制陶术',
						'平面设计',
						'工业设计',
						'室内设计',
						'多媒体/视觉传达',
						'绘画',
						'摄影',
						'版画',
						'雕刻');

major_array[10]='传媒';
sub_array[10]=new Array('多媒体',
						'公共关系',
						'广告学',
						'大众传播',
						'国际传播',
						'品牌管理',
						'跨文化',
						'修辞研究',
						'人际传播',
						'批判性媒体研究',
						'报纸',
						'杂志',
						'广播',
						'创造性写作',
						'出版/电视录像制作');

